# class Solution:
#     def searchMatrix(self, matrix, target):
#

f = open(r"D:\Sohu2022_data\nlp_data\train.txt", encoding="utf-8")
for i in f:
    data = eval(i.strip())
    print(data)


sample= {'id': 1459,
         'content': '可借鉴点02：高收腰剪裁+v字领，显瘦又显高同时为了能够最大化地展现出身材优势，'
                    '陈红所选择的这几件时尚单品也加入了不少显高显瘦小细节：①上半部分的窄V领设计，'
                    '很好的打造出了向下延伸效果，轻松拉长脖子线条，既增加了造型的随性优雅感，又可以显瘦；'
                    '②皮衣虽然带有很强的中性帅气特质，但是在腰部位置进行了收腰剪裁，能够很好的勾勒出S型身材曲线，'
                    '配合上不规则的裙摆后两者之间能够打造出高腰感。53岁陈红也老了！穿休闲装陪陈凯歌参加名导聚会，'
                    '皮肤暗沉变大妈声明：文字原创，图片来自网络，如有侵权，联系删除。禁止抄袭，违者必究！文/落花生',
         'entity': {'陈红': -1}}
